---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightError
source: html/2df8cf4a-ee70-ceef-aaf1-d60897784abb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightError Property

Light source cannot be copied!

## Syntax (C#)
```csharp
public static FailureDefinitionId CopyImposterLightError { get; }
```